nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.setCursor(x + 2, y + 2);
    display.print(current, DEC);
    display.setTextColor(WHITE);
    display.display();

    do
    {

        if (encoder0Pos != keyPrev)
        {
            if (encoder0Pos < keyPrev)
            {
                current -= step;
            }
            else if (encoder0Pos > keyPrev)
            {
                current += step;
            }
            if (current > val_max)
                current = val_min;
            if (current < val_min)
                current = val_max;

            keyPrev = encoder0Pos;
            // sprintf(text, "%l", current);

            display.fillRect(x + 1, y + 1, w - 2, 9, WHITE);
            display.setTextColor(BLACK);
            /*for (i = 0; i <= strlen(text); i++) {
                display.setCursor((i * char_with) + x + 2, y + 2);
                display.print(text[i]);
            }*/
            display.setCursor(x + 2, y + 2);
            display.print(current, DEC);
            display.setTextColor(WHITE);
            display.display();
        }

        delay(50);
        if ((digitalRead(keyPush) == LOW))
        {
            currentTime = millis();
            delay(500);
            // if (digitalRead(keyPush) == HIGH)
            ok = true;
        }
    } while (!ok);
    display.fillRect(x + 1, y + 1, w - 2, 9, BLACK);
    display.setCursor(x + 2, y + 2);
    display.print(current, DEC);
    // text[i] = 0;
    display.display();
    // msgBox(F("KEY Back"));
    while (digitalRead(keyPush) == LOW)
        ;
}

void MyComboBox::AddItem(int index, char *str)
{
    strcpy(&item[index][0], str);
}

void MyComboBox::GetItem(int index, char *str)
{
    strcpy(str, &item[index][0]);
}

void MyComboBox::maxItem(unsigned char index)
{
    char_max = index;
}

unsigned long MyComboBox::GetValue()
{
    return current;
}

unsigned char MyComboBox::GetIndex()
{
    return current_index;
}
void MyComboBox::SetIndex(unsigned int i)
{
    if (isValue)
    {
        current = i;
    }
    else
    {
        current_index = i;
        if (current_index >= char_max)
            current_index = 0;
    }
}

void MyComboBox::SelectItem()
{
    int w = (length * 7) + 4;
    int keyPrev = encoder0Pos;
    bool ok = false;
    Show();
    display.fillRect(x + 1, y + 1, w - 2, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(x + 2, y + 2);
    display.print(item[current_index]);
    display.setTextColor(WHITE);
    display.display();

    do
    {
        if (encoder0Pos != keyPrev)
        {
            if (encoder0Pos < keyPrev)
            {
                current_index++;
            }
            else if (encoder0Pos > keyPrev)
            {
                current_index--;
            }
            if (current_index >= char_max)
                current_index = char_min;
            // if (current_index < char_min) current_index = char_max;

            keyPrev = encoder0Pos;
            // tb = (double)current / 1000000;
            // dtostrf(tb, 3, 5, text);

            display.fillRect(x + 1, y + 1, w - 2, 9, WHITE);
            display.setTextColor(BLACK);
            display.setCursor(x + 2, y + 2);
            display.print(item[current_index]);
            display.setTextColor(WHITE);
            display.display();
        }

        delay(50);
        if ((digitalRead(keyPush) == LOW))
        {
            currentTime = millis();
            delay(500);
            // if (digitalRead(keyPush) == HIGH)
            ok = true;
        }
    } while (!ok);
    Show();
    // msgBox(F("KEY Back"));
    while (digitalRead(keyPush) == LOW)
        ;
    // Show();
}

void MyComboBox::Show()
{
    int w = (length * 7) + 4;
    // int char_with = 7;
    // unsigned int i;
    display.fillRect(x, y, w + 10, 11, BLACK);
    display.drawRect(x, y, w, 11, WHITE);
    display.drawRect(x + w - 1, y, 10, 11, WHITE);
    // display.fillRect(x + 1, y + 1, w - 2, 9, BLACK);
    if (isSelect)
    {
        // display.drawRect(x + 1, y + 1, w - 2, 9, WHITE);
        // display.fillTriangle(x + w + 1, y + 9, x + w + 1 + 4, y + 2, x + w + 1 + 8, y + 9, WHITE);
        // display.fillTriangle(x + w + 2 + 5, y + 2, x + w + 2 + 5 + 8, y + 2, x + w + 2 + 5 + 4, y + 9, WHITE);
        display.fillTriangle(x + w, y + 2, x + w + 8, y + 2, x + w + 4, y + 9, WHITE);
    }
    else
    {
        // display.drawTriangle(x + w + 1, y + 9, x + w + 1 + 4, y + 2, x + w + 1 + 8, y + 9, WHITE);
        // display.drawTriangle(x + w + 2 + 5, y + 2, x + w + 2 + 5 + 8, y + 2, x + w + 2 + 5 + 4, y + 9, WHITE);
        display.drawTriangle(x + w, y + 2, x + w + 8, y + 2, x + w + 4, y + 9, WHITE);
    }
    if (isValue == true)
    {
        // sprintf(text, "%d", current);
        display.setCursor(x + 2, y + 2);
        display.print(current, DEC);
    }
    else
    {
        display.setCursor(x + 2, y + 2);
        display.print(item[current_index]);
        // for (i = 0; i <= strlen(item[current_index]); i++) {
        //	display.setCursor((i * char_with) + x + 2, y + 2);
        //	display.print(item[current_index][i]);
        // }
    }
    display.display();
}

unsigned char MySymbolBox::GetTable()
{
    return table;
}
unsigned char MySymbolBox::GetSymbol()
{
    return symbol;
}
unsigned char MySymbolBox::GetIndex()
{
    return MySymbolBox::current_index;
}
void MySymbolBox::SetIndex(unsigned char i)
{
    current_index = i;
    if (current_index >= 0x80)
        current_index = 0x80;
}

void MySymbolBox::SelectItem()
{
    int keyPrev = encoder0Pos;
    bool ok = false;
    onSelect = true;
    if (table == '/')
    {
        tableMode = 0;
    }
    else if (table == '\\')
    {
        tableMode = 1;
    }
    else
    {
        tableMode = 2;
    }

    Show();

    do
    {
        if (encoder0Pos != keyPrev)
        {
            if (encoder0Pos < keyPrev)
            {
                current_index++;
            }
            else if (encoder0Pos > keyPrev)
            {
                current_index--;
            }
            if (tableMode == 2)
            {
                if (current_index >= 'Z')
                    current_index = 'A';
                if (current_index < 'A')
                    current_index = 'Z';
            }
            else
            {
                if (current_index >= 0x80)
                    current_index = 0x21;
                if (current_index < 0x21)
                    current_index = 0x80;
            }

            keyPrev = encoder0Pos;
            if (tableMode == 2)
            {
                table = current_index;
                symbol = '&';
            }
            else
            {
                symbol = current_index;
            }
            Show();
        }

        delay(50);
        if ((digitalRead(keyPush) == LOW))
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                delay(100);
                // currentTime = millis();
                // while (digitalRead(keyPush) == HIGH) {
                //	delay(10);
                //	if ((millis() - currentTime) > 1000) break; //OK Timeout
                // };
                if (++tableMode > 2)
                    tableMode = 0;
                switch (tableMode)
                {
                case 0:
                    table = '/';
                    break;
                case 1:
                    table = '\\';
                    break;
                case 2:
                    if (table < 'A' || table > 'Z')
                        table = 'N';
                    symbol = '&';
                    break;
                }
                // if (table == '/')
                //	table = '\\';
                // else if (table == '\\')
                //	table = '/';
                Show();
                // while (digitalRead(keyPush) == LOW) delay(10);
            }
            else
            {
                ok = true;
            }
        }
    } while (!ok);
    onSelect = false;
    Show();
    // msgBox(F("KEY Back"));
    while (digitalRead(keyPush) == LOW)
        ;
    // Show();
}

void MySymbolBox::Show()
{
    // int w = 16 + 4;
    // int char_with = 7;
    // unsigned int i;
    display.fillRect(x, y, 20 + 14, 20, BLACK);
    // display.drawRect(x, y, 20, 20, WHITE);
    if (isSelect)
    {
        if (onSelect)
        {
            display.drawRoundRect(x, y, 20, 20, 5, WHITE);
        }
        else
        {
            display.drawRect(x, y, 20, 20, WHITE);
            display.drawRect(x + 1, y + 1, 18, 18, WHITE);
        }
        display.setCursor(x + 22, y + 2);
        display.print(table);
        display.setCursor(x + 22, y + 11);
        display.print(symbol);
    }
    else
    {
        display.drawRect(x, y, 20, 20, WHITE);
    }
    const uint8_t *ptrSymbol;
    uint8_t symIdx = symbol - 0x21;
    if (symIdx > 95)
        symIdx = 0;
    if (table == '/')
    {
        ptrSymbol = &Icon_TableA[symIdx][0];
    }
    else if (table == '\\')
    {
        ptrSymbol = &Icon_TableB[symIdx][0];
    }
    else
    {
        if (table < 'A' || table > 'Z')
            table = 'N';
        symbol = '&';
        symIdx = 5; // &
        ptrSymbol = &Icon_TableB[symIdx][0];
    }
    display.drawYBitmap(x + 2, y + 2, ptrSymbol, 16, 16, WHITE);
    if (!(table == '/' || table == '\\'))
    {
        display.drawChar(x + 7, y + 6, table, BLACK, WHITE, 1);
        display.drawChar(x + 8, y + 7, table, BLACK, WHITE, 1);
    }
    display.display();
}

