nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
// Renderer

class MyRenderer : public MenuComponentRenderer
{
public:
    virtual void render(Menu const &menu) const
    {
        String str;
        int x;
        display.clearDisplay();
        display.fillRect(0, 0, 128, 14, WHITE);
        // display.setFont(&FreeSansBold9pt7b);
        display.setFont(&FreeSerifItalic9pt7b);
        display.setTextColor(BLACK);
        str = String(menu.get_name());
        if (str.length() == 0)
            str = String("MAIN MENU");
        // x = str.length() * 6;
        // display.setCursor(64 - (x / 2), 4);
        x = str.length() * 10;
        display.setCursor(63 - (x / 2), 12);
        display.print(str);

        // display.setCursor(0, 8);
        // display.print(menu.get_current_component_num(),DEC);
        // display.setCursor(10, 8);
        // display.print(menu.get_num_components(), DEC);
        // display.setCursor(20, 8);
        // display.print(menu.get_previous_component_num(), DEC);
        // menu.render(*this);
        // menu.get_current_component()->render(*this);
        display.setFont();
        display.setTextColor(WHITE);
        int16_t line = 16;
        for (int i = 0; i < menu.get_num_components(); ++i)
        {
            MenuComponent const *cp_m_comp = menu.get_menu_component(i);
            cp_m_comp->render(*this);
            // SerialLOG.println(cp_m_comp->get_name());
            display.setCursor(10, line);
            display.print(cp_m_comp->get_name());

            if (cp_m_comp->is_current())
            {
                // SerialLOG.print("<<< ");
                display.setCursor(0, line);
                display.write(16);
            }
            line = line + 10;
            // SerialLOG.println("");
        }
        display.display();
    }

    virtual void render_menu_item(MenuItem const &menu_item) const
    {
        // display.fillRect(0, 8, 128, 8, BLACK);
        // display.setCursor(0, 8);
        // display.print(menu_item.get_name());
        // display.display();
    }

    virtual void render_back_menu_item(BackMenuItem const &menu_item) const
    {
        // display.fillRect(0, 8, 128, 8, BLACK);
        // display.setCursor(0, 1 * 8);
        // display.print(menu_item.get_name());
        // display.display();
    }

    virtual void render_numeric_menu_item(NumericMenuItem const &menu_item) const
    {
        // display.fillRect(0, 8, 128, 8, BLACK);
        // display.setCursor(0, 1 * 8);
        // display.print(menu_item.get_name());
    }

    virtual void render_menu(Menu const &menu) const
    {
        // display.fillRect(0, 0, 128, 8, BLACK);
        // display.setCursor(0, 0);
        // display.print(menu.get_name());
        // display.display();
    }
};

MyRenderer my_renderer;

void on_stationbeacon_selected(MenuItem *p_menu_item)
{
    int i;
    MyCheckBox chkBox[3];
    int max_sel = 8;
    MySymbolBox symBox[2];
    MyComboBox cbBox[3];
    String str;
    int x;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("STATION BEACON");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    chkBox[0].Checked = config.sta_compress;
    chkBox[0].x = 0;
    chkBox[0].y = 18;
    sprintf(chkBox[0].text, "COMP");

    chkBox[1].Checked = config.sta_altitude;
    chkBox[1].x = 40;
    chkBox[1].y = 18;
    sprintf(chkBox[1].text, "ALT");

    chkBox[2].Checked = config.sta_speed;
    chkBox[2].x = 75;
    chkBox[2].y = 18;
    sprintf(chkBox[2].text, "CSR/SPD");

    display.setCursor(0, 30);
    display.print("SPD:");
    cbBox[0].isValue = true;
    cbBox[0].x = 25;
    cbBox[0].y = 28;
    cbBox[0].length = 3;
    cbBox[0].char_max = 250;
    cbBox[0].SetIndex(config.sta_hspeed);

    display.setCursor(0, 42);
    display.print("INV:");
    cbBox[1].isValue = true;
    cbBox[1].x = 25;
    cbBox[1].y = 40;
    cbBox[1].length = 2;
    cbBox[1].char_max = 120;
    cbBox[1].SetIndex(config.sta_maxinterval);

    display.setCursor(0, 54);
    display.print("ANG:");
    cbBox[2].isValue = true;
    cbBox[2].x = 25;
    cbBox[2].y = 52;
    cbBox[2].length = 2;
    cbBox[2].char_max = 180;
    cbBox[2].SetIndex(config.sta_minangle);

    display.setCursor(67, 35);
    display.print("MOV");
    symBox[0].x = 65;
    symBox[0].y = 43;
    symBox[0].table = config.sta_symmove[0];
    symBox[0].symbol = config.sta_symmove[1];
    symBox[0].SetIndex(config.sta_symmove[1]);
    symBox[0].Show();

    display.setCursor(99, 35);
    display.print("STP");
    symBox[1].x = 98;
    symBox[1].y = 43;
    symBox[1].table = config.sta_symstop[0];
    symBox[1].symbol = config.sta_symstop[1];
    symBox[1].SetIndex(config.sta_symstop[1]);
    symBox[1].Show();

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 3; i++)
            {
                chkBox[i].isSelect = false;
                cbBox[i].isSelect = false;
            }
            symBox[0].isSelect = false;
            symBox[1].isSelect = false;

            if (encoder0Pos < 3)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos > 2 && encoder0Pos < 6)
                cbBox[encoder0Pos - 3].isSelect = true;
            if (encoder0Pos > 5)
                symBox[encoder0Pos - 6].isSelect = true;
            for (i = 0; i < 3; i++)
            {
                chkBox[i].CheckBoxShow();
                cbBox[i].Show();
            }
            symBox[0].Show();
            symBox[1].Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i < 3)
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.sta_compress = chkBox[i].Checked;
                        break;
                    case 1:
                        config.sta_altitude = chkBox[i].Checked;
                        break;
                    case 2:
                        config.sta_speed = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                else if (i > 2 && i < 6)
                {
                    i -= 3;
                    switch (i)
                    {
                    case 0:
                        cbBox[i].SelectValue(10, 200, 1);
                        config.sta_hspeed = cbBox[i].GetValue();
                        break;
                    case 1:
                        cbBox[i].SelectValue(5, 60, 1);
                        config.sta_maxinterval = cbBox[i].GetValue();
                        break;
                    case 2:
                        cbBox[i].SelectValue(5, 90, 1);
                        config.sta_minangle = cbBox[i].GetValue();
                        break;
                    }
                    encoder0Pos = keyPrev;
                    cbBox[i].Show();
                }
                else if (encoder0Pos > 5)
                {
                    i -= 6;
                    symBox[i].SelectItem();
                    switch (i)
                    {
                    case 0:
                        config.sta_symmove[0] = symBox[i].table;
                        config.sta_symmove[1] = symBox[i].symbol;
                        break;
                    case 1:
                        config.sta_symstop[0] = symBox[i].table;
                        config.sta_symstop[1] = symBox[i].symbol;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    symBox[i].Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_wifi_selected(MenuItem *p_menu_item)
{
    MyTextBox txtBox[2];
    MyCheckBox chkBoxWiFi;
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int max_sel = 4;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("WIFI CONFIGURATION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("SSID:");
    txtBox[0].x = 0;
    txtBox[0].y = 27;
    txtBox[0].length = 17;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.wifi_ssid);

    chkBoxWiFi.Checked = config.wifi;
    chkBoxWiFi.x = 92;
    chkBoxWiFi.y = 18;
    sprintf(chkBoxWiFi.text, "WiFi");

