nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.setCursor(0, 44);
    display.print("PASS:");
    txtBox[1].x = 0;
    txtBox[1].y = 53;
    txtBox[1].length = 14;
    txtBox[1].type = 0;
    strcpy(txtBox[1].text, config.wifi_pass);

    display.setCursor(55, 42);
    display.print("PWR:");
    display.setCursor(110, 42);
    display.print("dBm");
    cbBox.isValue = true;
    cbBox.x = 80;
    cbBox.y = 40;
    cbBox.length = 2;
    cbBox.maxItem(20);
    cbBox.char_max = 20;
    cbBox.SetIndex(config.wifi_power);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 2; i++)
                txtBox[i].isSelect = false;
            chkBoxWiFi.isSelect = false;
            cbBox.isSelect = false;
            if (encoder0Pos < 2)
                txtBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 2)
                chkBoxWiFi.isSelect = true;
            if (encoder0Pos == 3)
                cbBox.isSelect = true;
            for (i = 0; i < 2; i++)
                txtBox[i].TextBoxShow();
            chkBoxWiFi.CheckBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    // msgBox("KEY Back");
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (encoder0Pos < 2)
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strcpy(config.wifi_ssid, txtBox[0].text);
                        break;
                    case 1:
                        strcpy(config.wifi_pass, txtBox[1].text);
                        break;
                    }
                    encoder0Pos = keyPrev + 1;
                }
                else if (encoder0Pos == 2)
                {
                    chkBoxWiFi.Toggle();
                    config.wifi = chkBoxWiFi.Checked;
                    encoder0Pos = keyPrev;
                    chkBoxWiFi.CheckBoxShow();
                }
                else if (encoder0Pos == 3)
                {
                    cbBox.SelectValue(0, 20, 1);
                    config.wifi_power = (unsigned char)cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    // if (config.wifi_enable)
    // {
    //     WiFi.disconnect(false);
    //     conStatNetwork = CON_WIFI;
    // }
    // else
    // {
    //     WiFi.disconnect(true);
    //     conStatNetwork = CON_WIFI;
    // }
}
void on_stationconfig_selected(MenuItem *p_menu_item)
{
    int max_sel = 7;
    MyTextBox txtBox[3];
    MySymbolBox symBox;
    MyCheckBox chkGPS, chkSMBeacon;
    MyComboBox cbBox;
    String str;
    char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("MY IGATE/STATION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    // str = String(mycallsign);
    // str.toUpperCase();
    // str.toCharArray(&ch[0],10);
    display.setCursor(0, 18);
    display.print("MyCall:");
    txtBox[0].x = 41;
    txtBox[0].y = 16;
    txtBox[0].length = 7;
    txtBox[0].type = 0;
    str = String(config.aprs_mycall);
    str.toUpperCase();
    str.toCharArray(&ch[0], 10);
    strcpy(txtBox[0].text, ch);
    // TextBoxShow(&ch[0], 44, 16, 7);
    // strcpy(mycallsign, ch);

    // sprintf(ch, "%d", myssid);
    display.setCursor(95, 18);
    display.print("-");
    cbBox.isValue = true;
    cbBox.x = 101;
    cbBox.y = 16;
    cbBox.length = 2;
    cbBox.maxItem(15);
    cbBox.char_max = 15;
    cbBox.SetIndex(config.aprs_ssid);
    // txtBox[1].x = 106;
    // txtBox[1].y = 16;
    // txtBox[1].length = 2;
    // txtBox[1].type = 1;
    // sprintf(txtBox[1].text, "%d", config.myssid);
    // TextBoxShow(&ch[0], 106, 16, 2);
    // TextBoxArrayShow(&txtBox[0]);
    // myssid = atol(ch);

    display.setCursor(0, 30);
    display.print("LAT:");
    // TextBoxShow(&mylat[0], 26, 28, 8);
    txtBox[1].x = 26;
    txtBox[1].y = 28;
    txtBox[1].length = 8;
    txtBox[1].type = 1;
    sprintf(txtBox[1].text, "%.5f", config.gps_lat);

    display.setCursor(0, 42);
    display.print("LON:");
    // TextBoxShow(&mylon[0], 26, 40,9);
    txtBox[2].x = 26;
    txtBox[2].y = 40;
    txtBox[2].length = 9;
    txtBox[2].type = 1;
    sprintf(txtBox[2].text, "%.5f", config.gps_lon);

    chkGPS.Checked = config.mygps;
    chkGPS.isSelect = false;
    chkGPS.x = 0;
    chkGPS.y = 54;
    sprintf(chkGPS.text, "GPS");
    // chkGPS.CheckBoxShow();

    chkSMBeacon.Checked = config.sta_smartbeacon;
    chkSMBeacon.isSelect = false;
    chkSMBeacon.x = 35;
    chkSMBeacon.y = 54;
    sprintf(chkSMBeacon.text, "SmartBCN");

    display.fillRect(98, 31, 30, 11, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(100, 33);
    display.print("ICON");
    display.setTextColor(WHITE);
    symBox.x = 98;
    symBox.y = 43;
    symBox.table = config.mysymbol[0];
    symBox.symbol = config.mysymbol[1];
    symBox.SetIndex(config.mysymbol[1]);

    // txtBox[4].x = 44;
    // txtBox[4].y = 52;
    // txtBox[4].length = 2;
    // strcpy(txtBox[4].text, config.mysymbol);

