nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < max_sel; i++)
            {
                if (i < 3)
                    txtBox[i].isSelect = false;
                if (i == 3)
                    cbBox.isSelect = false;
                if (i == 6)
                    symBox.isSelect = false;
                if (i == 5)
                    chkSMBeacon.isSelect = false;
                if (i == 4)
                    chkGPS.isSelect = false;
            }
            if (encoder0Pos < 3)
                txtBox[encoder0Pos].isSelect = true;
            if (encoder0Pos == 6)
                symBox.isSelect = true;
            if (encoder0Pos == 5)
                chkSMBeacon.isSelect = true;
            if (encoder0Pos == 4)
                chkGPS.isSelect = true;
            if (encoder0Pos == 3)
                cbBox.isSelect = true;
            for (i = 0; i < 3; i++)
                txtBox[i].TextBoxShow();
            symBox.Show();
            chkGPS.CheckBoxShow();
            chkSMBeacon.CheckBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i == 6)
                {
                    symBox.SelectItem();
                    config.mysymbol[0] = symBox.table;
                    config.mysymbol[1] = symBox.symbol;
                    encoder0Pos = keyPrev;
                }
                else if (i == 4)
                {
                    chkGPS.Toggle();
                    config.mygps = chkGPS.Checked;
                    if (config.mygps == false)
                    {
                        chkSMBeacon.Checked = false;
                        chkSMBeacon.CheckBoxShow();
                    }
                    encoder0Pos = keyPrev;
                    chkGPS.CheckBoxShow();
                }
                else if (i == 5)
                {
                    chkSMBeacon.Toggle();
                    config.sta_smartbeacon = chkSMBeacon.Checked;
                    encoder0Pos = keyPrev;
                    chkSMBeacon.CheckBoxShow();
                }
                else if (i == 3)
                {
                    cbBox.SelectValue(0, 15, 1);
                    config.aprs_ssid = cbBox.GetValue();
                    encoder0Pos = keyPrev;
                    cbBox.Show();
                }
                else
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strncpy(config.aprs_mycall, txtBox[i].text, 7);
                        config.aprs_mycall[7] = 0;
                        break;
                    // case 1: config.myssid = atol(txtBox[i].text);
                    //	break;
                    case 1:
                        config.gps_lat = atof(txtBox[i].text); // strcpy(config.mylat, txtBox[i].text);
                        break;
                    case 2:
                        config.gps_lon = atof(txtBox[i].text); // strcpy(config.mylon, txtBox[i].text);
                        break;
                        // case 4: strcpy(config.mysymbol, txtBox[i].text);
                        //	break;
                    }
                    encoder0Pos = keyPrev + 1;
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}
void on_aprsserver_selected(MenuItem *p_menu_item)
{
    int max_sel = 4;
    MyTextBox txtBox[3];
    MyComboBox cbBox;
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("APRS SERVER CONFIG");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("SERVER:");
    txtBox[0].x = 0;
    txtBox[0].y = 28;
    txtBox[0].length = 17;
    txtBox[0].type = 0;
    strcpy(txtBox[0].text, config.aprs_host);

    display.setCursor(55, 18);
    display.print("PORT:");
    txtBox[1].x = 85;
    txtBox[1].y = 16;
    txtBox[1].length = 5;
    txtBox[1].type = 1;
    sprintf(txtBox[1].text, "%d", config.aprs_port);
    // strcpy(txtBox[1].text, config.wifi_password);

    display.setCursor(0, 42);
    display.print("Filter:");
    txtBox[2].x = 0;
    txtBox[2].y = 52;
    txtBox[2].length = 17;
    txtBox[2].type = 0;
    strcpy(txtBox[2].text, config.aprs_filter);

    cbBox.isValue = false;
    cbBox.x = 53;
    cbBox.y = 40;
    cbBox.length = 8;
    cbBox.AddItem(0, "CALLSIGN");   // g/HS*/E2*
    cbBox.AddItem(1, "THAI MSG");   // g/HS*/E2*
    cbBox.AddItem(2, "THAI ALL");   // b/HS*/E2*
    cbBox.AddItem(3, "THAI IGATE"); // e/HS*/E2*
    cbBox.AddItem(4, "THAI DIGI");  // d/HS*/E2*
    cbBox.AddItem(5, "NO RECV");    // m/1
    cbBox.maxItem(6);
    // cbBox.char_max = 999;
    cbBox.SetIndex(0);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= max_sel)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = max_sel - 1;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < 3; i++)
                txtBox[i].isSelect = false;
            cbBox.isSelect = false;
            if (encoder0Pos < 3)
                txtBox[encoder0Pos].isSelect = true;
            else
                cbBox.isSelect = true;
            for (i = 0; i < 3; i++)
                txtBox[i].TextBoxShow();
            cbBox.Show();
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                {
                    break; // OK Timeout
                }
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i < 3)
                {
                    txtBox[i].TextBox();
                    switch (i)
                    {
                    case 0:
                        strcpy(config.aprs_host, txtBox[0].text);
                        break;
                    case 1:
                        config.aprs_port = atol(txtBox[1].text);
                        break;
                    case 2:
                        strcpy(config.aprs_filter, txtBox[2].text);
                        break;
                    }
                }
                else
                {
                    cbBox.SelectItem();
                    switch (cbBox.GetIndex())
                    {
                    case 0:
                        strcpy(txtBox[2].text, "b/HS5TQA-9");
                        break;
                    case 1:
                        strcpy(txtBox[2].text, "g/HS*/E2*");
                        break;
                    case 2:
                        strcpy(txtBox[2].text, "b/HS*/E2*");
                        break;
                    case 3:
                        strcpy(txtBox[2].text, "e/HS*/E2*");
                        break;
                    case 4:
                        strcpy(txtBox[2].text, "d/HS*/E2*");
                        break;
                    case 5:
                        strcpy(txtBox[2].text, "m/1");
                        break;
                    }
                    strcpy(config.aprs_filter, txtBox[2].text);
                }
                encoder0Pos = keyPrev + 1;
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
    // client.flush();
    // client.clearWriteError();
    // delay(500);
    // client.stop();
    // conStatNetwork = CON_SERVER;
}
void on_tncfunction_selected(MenuItem *p_menu_item)
{
    int max_sel = 9;
    // MyTextBox txtBox[2];
    MyCheckBox chkBox[9];
    String str;
    // char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("nTNC SETTING");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

