nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    chkBox[2].Checked = config.filterStatus;
    chkBox[2].x = 75;
    chkBox[2].y = 16;
    sprintf(chkBox[2].text, "STATUS");

    chkBox[3].Checked = config.filterWeather;
    chkBox[3].x = 0;
    chkBox[3].y = 25;
    sprintf(chkBox[3].text, "WX");

    chkBox[4].Checked = config.filterTelemetry;
    chkBox[4].x = 35;
    chkBox[4].y = 25;
    sprintf(chkBox[4].text, "TLM");

    chkBox[5].Checked = config.filterTracker;
    chkBox[5].x = 75;
    chkBox[5].y = 25;
    sprintf(chkBox[5].text, "TRACKER");

    chkBox[6].Checked = config.filterMessage;
    chkBox[6].x = 0;
    chkBox[6].y = 34;
    sprintf(chkBox[6].text, "MSG");

    chkBox[7].Checked = config.filterMove;
    chkBox[7].x = 35;
    chkBox[7].y = 34;
    sprintf(chkBox[7].text, "MOVE");

    chkBox[8].Checked = config.filterPosition;
    chkBox[8].x = 75;
    chkBox[8].y = 34;
    sprintf(chkBox[8].text, "STATION");

    chkBox[9].Checked = config.h_up;
    chkBox[9].x = 0;
    chkBox[9].y = 43;
    sprintf(chkBox[9].text, "H-UP");

    chkBox[10].Checked = config.tx_status;
    chkBox[10].x = 35;
    chkBox[10].y = 43;
    sprintf(chkBox[10].text, "TXS");

    display.setCursor(0, 54);
    display.print("DLY:");
    // display.setCursor(55, 54);
    // display.print("S");
    cbBox[0].isValue = true;
    cbBox[0].x = 25;
    cbBox[0].y = 52;
    cbBox[0].length = 3;
    cbBox[0].char_max = 999;
    cbBox[0].SetIndex(config.dispDelay);

    display.setCursor(64, 54);
    display.print("DIST<");
    cbBox[1].isValue = true;
    cbBox[1].x = 64 + 30;
    cbBox[1].y = 52;
    cbBox[1].length = 3;
    cbBox[1].char_max = 999;
    cbBox[1].SetIndex(config.filterDistant);

    display.display();
    encoder0Pos = 0;
    delay(100);
    do
    {
        if (encoder0Pos >= 13)
            encoder0Pos = 0;
        if (encoder0Pos < 0)
            encoder0Pos = 12;
        if (keyPrev != encoder0Pos)
        {
            keyPrev = encoder0Pos;
            for (i = 0; i < max_sel; i++)
            {
                chkBox[i].isSelect = false;
            }
            for (i = 0; i < 2; i++)
                cbBox[i].isSelect = false;
            for (i = 0; i < max_sel; i++)
                chkBox[i].isSelect = false;
            if (encoder0Pos < 11)
                chkBox[encoder0Pos].isSelect = true;
            if (encoder0Pos > 10 && encoder0Pos < 13)
                cbBox[encoder0Pos - 11].isSelect = true;
            for (i = 0; i < max_sel; i++)
                chkBox[i].CheckBoxShow();
            for (i = 0; i < 2; i++)
            {
                cbBox[i].Show();
            }
        }
        else
        {
            delay(50);
        }
        if (digitalRead(keyPush) == LOW)
        {
            currentTime = millis();
            while (digitalRead(keyPush) == LOW)
            {
                if ((millis() - currentTime) > 2000)
                    break; // OK Timeout
            };
            if ((millis() - currentTime) < 1500)
            {
                i = encoder0Pos;
                if (i < 11)
                {
                    chkBox[i].Toggle();
                    switch (i)
                    {
                    case 0:
                        config.dispTNC = chkBox[i].Checked;
                        break;
                    case 1:
                        config.dispINET = chkBox[i].Checked;
                        break;
                    case 2:
                        config.filterStatus = chkBox[i].Checked;
                        break;
                    case 3:
                        config.filterWeather = chkBox[i].Checked;
                        break;
                    case 4:
                        config.filterTelemetry = chkBox[i].Checked;
                        break;
                    case 5:
                        config.filterTracker = chkBox[i].Checked;
                        break;
                    case 6:
                        config.filterMessage = chkBox[i].Checked;
                        break;
                    case 7:
                        config.filterMove = chkBox[i].Checked;
                        break;
                    case 8:
                        config.filterPosition = chkBox[i].Checked;
                        break;
                    case 9:
                        config.h_up = chkBox[i].Checked;
                        break;
                    case 10:
                        config.tx_status = chkBox[i].Checked;
                        break;
                    }
                    encoder0Pos = keyPrev;
                    chkBox[i].CheckBoxShow();
                }
                else if (i > 10 && i < 13)
                {
                    i -= 11;
                    switch (i)
                    {
                    case 0:
                        cbBox[i].SelectValue(1, 600, 1);
                        config.dispDelay = (unsigned int)cbBox[i].GetValue();
                        break;
                    case 1:
                        cbBox[i].SelectValue(0, 999, 1);
                        config.filterDistant = (unsigned int)cbBox[i].GetValue();
                        break;
                    }
                    encoder0Pos = keyPrev;
                    cbBox[i].Show();
                }
                while (digitalRead(keyPush) == LOW)
                    ;
            }
            else
            {
                break;
            }
        }
    } while (1);
    /*display.clearDisplay();
    display.setCursor(30, 4);
    display.print("SAVE & EXIT");
    display.display();*/
    msgBox("KEY EXIT");
    while (digitalRead(keyPush) == LOW)
        ;
    saveEEPROM();
}

void on_tncconfig_selected(MenuItem *p_menu_item)
{
    int max_sel = 6;
    MyTextBox txtBox[5];
    // MySymbolBox symBox;
    // MyCheckBox chkGPS;
    MyComboBox cbBox;
    MyCheckBox chkEn;
    String str;
    char ch[10];
    int x, i;
    int keyPrev = -1;
    display.clearDisplay();
    display.fillRect(0, 0, 128, 16, WHITE);
    display.setTextColor(BLACK);
    str = String("nTNC CONFIGURATION");
    x = str.length() * 6;
    display.setCursor(64 - (x / 2), 4);
    display.print(str);
    display.setTextColor(WHITE);

    display.setCursor(0, 18);
    display.print("MyCall:");
    txtBox[0].x = 41;
    txtBox[0].y = 16;
    txtBox[0].length = 7;
    txtBox[0].type = 0;
    str = String(config.aprs_mycall);
    str.toUpperCase();
    str.toCharArray(&ch[0], 10);
    strcpy(txtBox[0].text, ch);

