nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
Menu mnu2("APRS IGATE");
MenuItem mnu2_mi1("APRS-IS", &on_aprsserver_selected);
MenuItem mnu2_mi2("Position", &on_stationconfig_selected);
MenuItem mnu2_mi3("Filter", &on_filter_selected);
MenuItem mnu2_mi4("Beacon", &on_stationbeacon_selected);

Menu mnu3("APRS TRACKER");
MenuItem mnu3_mi1("Position", &on_stationconfig_selected);
MenuItem mnu3_mi2("Function", &on_tncfunction_selected);
MenuItem mnu3_mi3("Filter", &on_filter_selected);
MenuItem mnu3_mi4("SmartBeacon", &on_stationbeacon_selected);

Menu mnu4("DIGI REPEATER");
MenuItem mnu4_mi1("Position", &on_stationconfig_selected);
MenuItem mnu4_mi2("Function", &on_tncfunction_selected);
MenuItem mnu4_mi3("Filter", &on_filter_selected);
MenuItem mnu4_mi4("SmartBeacon", &on_stationbeacon_selected);

Menu mnu5("SYSTEM");
MenuItem mnu5_mi1("Save/Load", &on_wifi_selected);
MenuItem mnu5_mi2("OLED Display", &on_display_selected);
MenuItem mnu5_mi3("Monitor", &on_filter_selected);

// Menu mu2("CONFIGURATION");
// MenuItem mu2_mi1("WiFi Config", &on_wifi_selected);
// MenuItem mu2_mi2("Station Fix", &on_stationconfig_selected);
// MenuItem mu2_mi3("Smart Beacon", &on_stationbeacon_selected);
// MenuItem mu2_mi4("APRS Server", &on_aprsserver_selected);
// MenuItem mu2_mi5("Filter Display", &on_filter_selected);

// Menu mu6("TNC SETTING");
// MenuItem mu6_mi0("TNC Config", &on_tncconfig_selected);
// MenuItem mu6_mi1("TNC Function", &on_tncfunction_selected);
// MenuItem mu6_mi2("TNC RF Module", &on_rfconfig_selected);
// // MenuItem mu6_mi2("TNC Tracker", &on_tnctracker_selected);
// // MenuItem mu6_mi3("TNC RF Module", &on_rfconfig_selected);
// //  MenuItem mu2_mi5("<--", &on_back_selected);
// Menu mu3("ABOUT");
// MenuItem mu3_mi1("OTA Update", &on_update_selected);
// MenuItem mu3_mi2("WiFi Status", &on_wifistatus_selected);
// MenuItem mu3_mi3("Infomations", &on_infomation_selected);
// MenuItem mu3_mi4("Dash Board", &on_dashboard_selected);
// // MenuItem mu3_mi4("<--", &on_back_selected);
// Menu mu4("SYSTEM");
// MenuItem mu4_mi1("Save Config", &on_save_selected);
// MenuItem mu4_mi2("Load Config", &on_load_selected);
// MenuItem mu4_mi3("Factory Reset", &on_factory_selected);
// MenuItem mu4_mi4("Display Config", &on_display_selected);
// //MenuItem mu4_mi5("Reboot", &on_reboot_selected);
// //MenuItem mu4_mi5()"Reboot", &on_reboot_selected);

// // MenuItem mu4_mi5("Dash Board", &on_system5_selected);
// // MenuItem mu4_mi6("<--", &on_back_selected);
// Menu mu5("TNC CONTROL");
// MenuItem mu5_mi1("nTNC Monitor", &on_tncmonitor_selected);
// MenuItem mu5_mi2("nTNC TX myBeacon", &on_txbeacon_selected);
// MenuItem mu5_mi3("nTNC TX Status", &on_txstatus_selected);

void on_back_selected(MenuItem *p_menu_item)
{
    line = 15;
    ms.back();
    ms.display();
}
// DigoleSerialDisp mydisp = DigoleSerialDisp(8, 9, 10);
// qMenuSystem menu = qMenuSystem(mydisp);

void statisticsDisp()
{

    // uint8_twifi = 0, i;
    int x;
    String str;
    display.fillRect(0, 16, 128, 10, WHITE);
    display.drawLine(0, 16, 0, 63, WHITE);
    display.drawLine(127, 16, 127, 63, WHITE);
    display.drawLine(0, 63, 127, 63, WHITE);
    display.fillRect(1, 25, 126, 38, BLACK);
    display.setTextColor(BLACK);
    display.setCursor(30, 17);
    display.print("STATISTICS");
    display.setCursor(108, 17);
    display.print("1/5");
    display.setTextColor(WHITE);

    // display.setCursor(3, 26);
    // display.print("ALL DATA");
    // str = String(status.allCount, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 26);
    // display.print(str);

    // display.setCursor(3, 35);
    // display.print("RF2INET");
    // str = String(status.rf2inet, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 35);
    // display.print(str);

    // display.setCursor(3, 44);
    // display.print("INET2RF");
    // str = String(status.inet2rf, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 44);
    // display.print(str);

    // display.setCursor(3, 53);
    // display.print("ERROR/DROP");
    // str = String(status.errorCount + status.dropCount, DEC);
    // x = str.length() * 6;
    // display.setCursor(126 - x, 53);
    // display.print(str);

    display.display();
}

void pkgLastDisp()
{

    uint8_t k = 0;
    int i;
    // char list[4];
    int x, y;
    String str;
    // String times;
    // pkgListType *ptr[100];

    display.fillRect(0, 16, 128, 10, WHITE);
    display.drawLine(0, 16, 0, 63, WHITE);
    display.drawLine(127, 16, 127, 63, WHITE);
    display.drawLine(0, 63, 127, 63, WHITE);
    display.fillRect(1, 25, 126, 38, BLACK);
    display.setTextColor(BLACK);
    display.setCursor(27, 17);
    display.print("LAST STATIONS");
    display.setCursor(108, 17);
    display.print("2/5");
    display.setTextColor(WHITE);

    sort(pkgList, PKGLISTSIZE);
    k = 0;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[i].time > 0)
        {
            y = 26 + (k * 9);
            // display.drawBitmap(3, y, &SYMBOL[0][0], 11, 6, WHITE);
            display.fillRoundRect(2, y, 7, 8, 2, WHITE);
            display.setCursor(3, y);
            pkgList[i].calsign[10] = 0;
            display.setTextColor(BLACK);
            switch (pkgList[i].type)
            {
            case PKG_OBJECT:
                display.print("O");
                break;
            case PKG_ITEM:
                display.print("I");
                break;
            case PKG_MESSAGE:
                display.print("M");
                break;
            case PKG_WX:
                display.print("W");
                break;
            case PKG_TELEMETRY:
                display.print("T");
                break;
            case PKG_QUERY:
                display.print("Q");
                break;
            case PKG_STATUS:
                display.print("S");
                break;
            default:
                display.print("*");
                break;
            }
            display.setTextColor(WHITE);
            display.setCursor(10, y);
            display.print(pkgList[i].calsign);
            display.setCursor(126 - 48, y);
            display.printf("%02d:%02d:%02d", hour(pkgList[i].time), minute(pkgList[i].time), second(pkgList[i].time));

            // str = String(hour(pkgList[i].time),DEC) + ":" + String(minute(pkgList[i].time), DEC) + ":" + String(second(pkgList[i].time), DEC);
            ////str = String(pkgList[pkgLast_array[i]].time, DEC);
            // x = str.length() * 6;
            // display.setCursor(126 - x, y);
            // display.print(str);
            k++;
            if (k >= 4)
                break;
        }
    }
    display.display();
}

void pkgCountDisp()
{

    // uint8_twifi = 0, k = 0, l;
    uint k = 0;
    int i;
    // char list[4];
    int x, y;
    String str;
    // String times;
    // pkgListType *ptr[100];

    display.fillRect(0, 16, 128, 10, WHITE);
    display.drawLine(0, 16, 0, 63, WHITE);
    display.drawLine(127, 16, 127, 63, WHITE);
    display.drawLine(0, 63, 127, 63, WHITE);
    display.fillRect(1, 25, 126, 38, BLACK);
    display.setTextColor(BLACK);
    display.setCursor(30, 17);
    display.print("TOP PACKAGE");
    display.setCursor(108, 17);
    display.print("3/5");
    display.setTextColor(WHITE);

    sortPkgDesc(pkgList, PKGLISTSIZE);
    k = 0;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[i].time > 0)
        {
            y = 26 + (k * 9);
            // display.drawBitmapV(2, y-1, &SYMBOL[pkgList[i].symbol][0], 11, 8, WHITE);
            pkgList[i].calsign[10] = 0;
            display.fillRoundRect(2, y, 7, 8, 2, WHITE);
            display.setCursor(3, y);
            pkgList[i].calsign[10] = 0;
            display.setTextColor(BLACK);
            switch (pkgList[i].type)
            {
            case PKG_OBJECT:
                display.print("O");
                break;
            case PKG_ITEM:
                display.print("I");
                break;
            case PKG_MESSAGE:
                display.print("M");
                break;
            case PKG_WX:
                display.print("W");
                break;
            case PKG_TELEMETRY:
                display.print("T");
                break;
            case PKG_QUERY:
                display.print("Q");
                break;
            case PKG_STATUS:
                display.print("S");
                break;
            default:
                display.print("*");
                break;
            }
            display.setTextColor(WHITE);
            display.setCursor(10, y);
            display.print(pkgList[i].calsign);
            str = String(pkgList[i].pkg, DEC);
            x = str.length() * 6;
            display.setCursor(126 - x, y);
            display.print(str);
            k++;
            if (k >= 4)
                break;
        }
    }
    display.display();
}

