nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
    if (gps.location.isValid())
    {
        display.setCursor(85, 0);
        display.print("GPS");
    }

    display.setCursor(110, 0);
    // if (config.tnc)
    // {
    //     if (nTNC)
    //     {
    //         display.print("TNC");
    //         // display.drawLine(50,0,65,8,WHITE);
    //     }
    //     else
    //     {
    //         display.print("NOT");
    //     }
    // }
    // else
    // {
    //     display.print("DIS");
    // }
    char strTime[10];
    struct tm tmstruct;
    tmstruct.tm_year = 0;
    getLocalTime(&tmstruct, 100);
    sprintf(strTime, "%02d:%02d:%02d", tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
    // sprintf(strTime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);

    display.setCursor(50, 8);
    display.print(strTime);
    // display.print(hour());
    // display.print(":");
    // display.print(minute());
    // display.print(":");
    // display.print(second());

    // display.setCursor(115, 8);
    // display.print(raw_count);
    if (config.dim == 2)
    { // Auto dim timeout
        if (millis() > (dimTimeout + 60000))
        {
            display.dim(true);
        }
        else
        {
            display.dim(false);
        }
    }
    else if (config.dim == 3)
    { // Dim for time
        if (hour() > 5 && hour() < 17)
        {
            display.dim(false);
        }
        else
        {
            display.dim(true);
        }
    }

    display.display();
}

// void doEncoder() {
//	encoder_A = digitalRead(keyA);
//	if (encoder_A != (encoder_A_prev)) {
//		if (digitalRead(keyA) == HIGH) {   // found a low-to-high on channel A
//										   //delay(1);
//			if (digitalRead(keyB) == LOW) {  // check channel B to see which way
//											 // encoder is turning
//				encoder0Pos = encoder0Pos - 1;         // CCW
//			}
//			else {
//				encoder0Pos = encoder0Pos + 1;         // CW
//			}
//		}
//		else                                        // found a high-to-low on channel A
//		{
//			if (digitalRead(keyB) == LOW) {   // check channel B to see which way
//											  // encoder is turning
//				encoder0Pos = encoder0Pos + 1;          // CW
//			}
//			else {
//				encoder0Pos = encoder0Pos - 1;          // CCW
//			}
//
//		}
//		encoder_A_prev = encoder_A;     // Store value of A for next time
//										//SerialLOG.println(encoder0Pos, DEC);
//	}
// }
uint8_t KeyDelay(uint8_t pin)
{
    int8_t Key = 0;
    int i = 0;
    uint8_t ret = 0;
    do
    {
        delay(1);
        if (digitalRead(pin))
            Key++;
        else
            Key--;
    } while (++i < 10);
    if (Key > 0)
        ret = 1;
    else
        ret = 0;
    return ret;
}

const int8_t KNOBDIR[] = {
    0, -1, 1, 0,
    1, 0, 0, -1,
    -1, 0, 0, 1,
    0, 1, -1, 0};

volatile int8_t _oldState;

volatile long _position;        // Internal position (4 times _positionExt)
volatile long _positionExt;     // External position
volatile long _positionExtPrev; // External position (used only for direction checking)

portMUX_TYPE muxKey = portMUX_INITIALIZER_UNLOCKED;
unsigned long keyPeriadTime;
void IRAM_ATTR doEncoder()
{
    portENTER_CRITICAL_ISR(&muxKey);
    int sig1 = digitalRead(keyA);
    int sig2 = digitalRead(keyB);
    int8_t thisState = sig1 | (sig2 << 1);

    if (_oldState != thisState)
    {
        _position += KNOBDIR[thisState | (_oldState << 2)];
        _oldState = thisState;
        //Serial.printf("Key:%d\n", _position >> 2);
        _positionExt = _position >> 2;
        if (_positionExtPrev != _positionExt)
        {
            if (_positionExtPrev > _positionExt)
            {
                encoder0Pos--;
            }
            else if (_positionExtPrev < _positionExt)
            {
                encoder0Pos++;
            }
            _positionExtPrev = _positionExt;
            //Serial.printf("Key:%d\n", _positionExt);
        }        
    }
    portEXIT_CRITICAL_ISR(&muxKey);
}

// boolean dataAct = false;
// uint8_t x = 0, y = 0;
// char str[300];
// String callSign;
// char callDest[8];
// char path[64];
// char raw[128];
// int posNow = 0;
// int timeHalfSec = 0;

void displayInfo()
{
    SerialLOG.print(F("Location: "));
    if (gps.location.isValid())
    {
        SerialLOG.print(gps.location.lat(), 6);
        SerialLOG.print(F(","));
        SerialLOG.print(gps.location.lng(), 6);
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.print(F("  Date/Time: "));
    if (gps.date.isValid())
    {
        SerialLOG.print(gps.date.month());
        SerialLOG.print(F("/"));
        SerialLOG.print(gps.date.day());
        SerialLOG.print(F("/"));
        SerialLOG.print(gps.date.year());
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.print(F(" "));
    if (gps.time.isValid())
    {
        if (gps.time.hour() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.hour());
        SerialLOG.print(F(":"));
        if (gps.time.minute() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.minute());
        SerialLOG.print(F(":"));
        if (gps.time.second() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.second());
        SerialLOG.print(F("."));
        if (gps.time.centisecond() < 10)
            SerialLOG.print(F("0"));
        SerialLOG.print(gps.time.centisecond());
    }
    else
    {
        SerialLOG.print(F("INVALID"));
    }

    SerialLOG.println();
}

// long lastGPS = 0;

unsigned long saveTimeout = 0;
unsigned long menuTimeout = 0;
unsigned long disp_delay = 0;
uint8_t dispMode = 0;
String rawDisp;
int selTab = 0;
bool dispPush = 0;

extern unsigned long timeGui;

void mainDisp(void *pvParameters)
{
    pinMode(keyA, INPUT_PULLUP);
    pinMode(keyB, INPUT_PULLUP);
    pinMode(keyPush, INPUT_PULLUP);
    // digitalWrite(keyA, LOW);
    // digitalWrite(keyB, LOW);
    // digitalWrite(keyPush, HIGH);

