nakhonthai/ESP32APRS_T-TWR/src/gui_lcd.cpp
                        ms.reset();
                        ms.display();

                        // TaskGPS.Enable(true);
                    }
                    break;
                }
            };
            while (digitalRead(keyPush) == LOW)
                delay(10);
        }

        if (conStat == CON_MENU)
        {
            delay(10);
            if (millis() > (menuTimeout + 60000L))
            {
                menuTimeout = millis();
                conStat = CON_NORMAL;
                /*if (WiFi.status() == WL_CONNECTED) {
                    conStat = CON_SERVER;
                    topBar(WiFi.RSSI());
                }
                else {
                    conStat = CON_WIFI;
                }*/
                // ESP.restart();
                // display.clearDisplay();
                // display.display();
                // if (config.tnc_init) tncInit();
                powerSave();
            }

            if (encoder0Pos != posNow)
            {
                saveTimeout = millis();
                menuTimeout = millis();
                line = 15; // line variable reset
                if (encoder0Pos > posNow)
                {
                    ms.next();
                    // ms.display();
                }
                else
                {
                    ms.prev();
                    // ms.display();
                }
                ms.display();
                posNow = encoder0Pos;
            }
            else
            {
                if ((digitalRead(keyPush) == LOW))
                {
                    saveTimeout = millis();
                    menuTimeout = millis();
                    currentTime = millis();
                    line = 15; // line variable reset
                    while (digitalRead(keyPush) == LOW)
                    {
                        delay(10);
                        if ((millis() - currentTime) > 1500)
                            break;
                    };
                    if ((millis() - currentTime) > 1000)
                    {
                        ms.back();
                    }
                    else
                    {
                        ms.select();
                    }
                    ms.display();
                    while (digitalRead(keyPush) == LOW)
                    {
                        delay(10);
                    }
                    menuTimeout = millis();
                }
            }
            // ms.display();
            // topBar(WiFi.RSSI());
        }

        //	else if (conStat == CON_WIFI) {
        //		topBar(WiFi.RSSI());
        // #ifdef DEBUG
        //		SerialLOG.println("WiFi Connecting");
        // #endif
        //		WiFi.disconnect(false);
        //		delay(500);
        //		WiFi.mode(WIFI_STA);
        //		WiFi.begin(config.wifi_ssid, config.wifi_password);
        //		display.fillRect(0, 16, 128, 48, BLACK);
        //		display.setCursor(0, 16);
        //		display.println("WiFi Connecting...");
        //		display.print("SSID: ");
        //		display.println((char*)& config.wifi_ssid);
        //		//display.display();
        //		//display.println("");
        //		display.display();
        //		//WiFi.disconnect();
        //		//WiFi.begin((char*)&ssid[current_wifi], (char*)&password[current_wifi]);         //�������͡Ѻ AP
        //		//topbar_timeout = 0;
        //		conStat = CON_SERVER;
        //		//aprsWdt = 0;
        //		aprsWdt = millis() + 20000;
        //		aprsRetry = 3;
        //		firstWiFiConnect = false;
        //		client.flush();
        //		Udp.flush();
        //		//yield();
        //		//showCallTimeout = millis() + 10000;
        //	}
        //	else if (conStat == CON_SERVER) {
        //		if (WiFi.status() == WL_CONNECTED) {
        //			topBar(WiFi.RSSI());
        // #ifdef DEBUG
        //			SerialLOG.println("WiFi Connected");
        // #endif
        //			display.println("APRS-IS Connecting..");
        //			display.display();
        //			//firstWiFiConnect = true;
        //			SerialLOG.print("IP number assigned by DHCP is ");
        //			SerialLOG.println(WiFi.localIP());
        //			if (firstWiFiConnect == 0) {
        //				firstWiFiConnect = true;
        //				SerialLOG.println("Starting UDP");
        //				Udp.flush();
        //				Udp.stopAll();
        //				delay(500);
        //				Udp.begin(localPort);
        //				SerialLOG.print("UDP Local port: ");
        //				SerialLOG.println(Udp.localPort());
        //				SerialLOG.println("waiting for sync");
        //				setSyncProvider(getNtpTime);
        //				setSyncInterval(300);
        //			}
        //			if (Client_Connect()) {
        // #ifdef DEBUG
        //				//SerialLOG.print(client.status());
        //				SerialLOG.println("APRS-IS Connected");
        // #endif
        //				conStat = CON_NORMAL;
        //				curTab = 1;
        //				TaskGPS.Enable(true);
        //				//timerBeacon = millis();
        //			}
        //			else {
        // #ifdef DEBUG
        //				//SerialLOG.println(str_status[client.status()]);
        //				SerialLOG.println("APRS-IS Connect Fail!");
        // #endif
        //				display.println("APRS-IS Fail!");
        //				display.display();
        //				//client.flush();
        //				//client.clearWriteError();
        //				//
        //				//client.stop();
        //				//if (aprsRetry-- == 0) {
        //				//	conStat = CON_WIFI;
        //				//	WiFi.disconnect(true);
        //				//	client.stopAll();
        //				//	Udp.stopAll();
        //				//	delay(500);
        //				//}
        //			}
        //		}
        //	}
        //	else {
        //
        //		if (WiFi.status() == WL_CONNECTED) {
        //			if (Client_Connect()) {
        //				if (client.available())              //ตรวจเช็คว่ามีการส่งค่ากลับมาจาก Server หรือไม่
        //				{
        //					aprsWdt = millis() + 30000;
        //					do {
        //						String line = client.readStringUntil('\n');       //อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
        // #ifdef DEBUG
        //						printTime();
        //						SerialLOG.print("APRS-IS ");
        //						SerialLOG.println(line);
        // #endif
        //						status.isCount++;
        //						int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
        //						if (start_val > 3) {
        //							String src_call = line.substring(0, start_val);
        //							String msg_call = "::" + src_call;
        //							status.allCount++;
        //							digiTLM.RX++;
        //							if (config.inet2rf) {
        //								if (line.indexOf(msg_call) <= 0) {
        //									raw[0] = '}';
        //									line.toCharArray(&raw[1], line.length());
        //									SerialTNC.println(raw);
        //									status.inet2rf++;
        //									digiTLM.INET2RF++;
        //									printTime();
        //									SerialLOG.print("INET2RF ");
        //									SerialLOG.println(raw);
        //								}
        //								else {
        //									digiTLM.DROP++;
        //									SerialLOG.print("INET2RF IS Message TELEMETRY from ");
        //									SerialLOG.println(src_call);
        //								}
        //							}
        //
        //							memset(&raw[0], 0, sizeof(raw));
        //							line.toCharArray(&raw[0], start_val + 1);
        //							raw[start_val + 1] = 0;
        //							pkgListUpdate(&raw[0], 0);
        //						}
        //						//else {
        //						//	status.errorCount++;
        //						//}
        //					} while (client.available());
        //
        //					if (config.mylocat) {
        //						if (timerBeacon < millis()) {
        //							timerBeacon = millis() + 600000; //10Min
        //							if ((config.mygps == true && gps.location.isValid() == true)||config.mygps==false) {
        //								status.isCount++;
        //								digiTLM.TX++;
        //								String raw = myBeacon();
        //								client.println(raw);
        // #ifdef DEBUG
        //								printTime();
        //								SerialLOG.print("BEACON ");
        //								SerialLOG.println(raw);
        // #endif
        //							}else {
        //								timerBeacon = millis() + 60000; //1Min
        //							}
        //						}
        //					}
        //					if (config.mytelemetry) {
        //						if (digiTLM.TeleTimeout < millis()) {
        //							digiTLM.TeleTimeout = millis() + 600000; //10Min
        //							if ((digiTLM.Sequence % 6) == 0) {
        //								sendIsPkgMsg((char*)& PARM[0]);
        //								sendIsPkgMsg((char*)& UNIT[0]);
        //								sendIsPkgMsg((char*)& EQNS[0]);
        //							}
        //							sprintf(raw, "T#%03d,%d,%d,%d,%d,%d,00000000", digiTLM.Sequence, digiTLM.RF2INET, digiTLM.INET2RF, digiTLM.RX, digiTLM.TX, digiTLM.DROP);
        //							sendIsPkg(raw);
        //							digiTLM.Sequence++;
        //							if (digiTLM.Sequence > 999) digiTLM.Sequence = 0;
        //							digiTLM.DROP = 0;
        //							digiTLM.INET2RF = 0;
        //							digiTLM.RF2INET = 0;
        //							digiTLM.RX = 0;
        //							digiTLM.TX = 0;
        //							//client.println(raw);
        //						}
        //					}
        //					client.flush();
        //				}
        //
        //				if (config.rf2inet) {
        //					if (SerialTNC.available() > 0) {
        //						status.allCount++;
        //						String tnc2 = SerialTNC.readStringUntil('\n');
        //						int start_val = tnc2.indexOf(">", 0); // หาตำแหน่งแรกของ >
        //						if (start_val > 3) {
        //							status.tncCount++;
        //							if (tnc2.indexOf("RFONLY", 10) > 0) {
        //								status.dropCount++;
        //								digiTLM.DROP++;
        //							}
        //							else {
        //								tnc2.toCharArray(&str[0], tnc2.length());
        //								int i = tnc2.indexOf(":");
        //								if (i > 10) {
        //									str[i] = 0;
        //									sprintf(raw, "%s,qAR,%s-%d:%s", &str[0], config.mycallsign, config.myssid, &str[i + 1]);
        //									tnc2 = String(raw);
        //									client.println(tnc2);
        //									status.rf2inet++;
        //									digiTLM.RF2INET++;
        //									digiTLM.TX++;
        //									printTime();
        //									SerialLOG.print("RF2INET ");
        //									SerialLOG.println(raw);
        //								}
        //								else {
        //									status.errorCount++;
        //									digiTLM.DROP++;
        //								}
        //							}
        //							memset(&raw[0], 0, sizeof(raw));
        //							tnc2.toCharArray(&raw[0], start_val + 1);
        //							raw[start_val + 1] = 0;
        //							pkgListUpdate(&raw[0], 1);
        // #ifdef DEBUG
        //							printTime();
        //							SerialLOG.print("TNC ");
        //							SerialLOG.println(tnc2);
        // #endif
        //						}
        //						else { status.errorCount++; }
        //
        //					}
        //				}
        //			}
        //			else {
        // #ifdef DEBUG
        //				//SerialLOG.print(client.status());
        //				SerialLOG.println("APRS-IS Disconnected");
        // #endif
        //				display.fillRect(0, 16, 128, 48, BLACK);
        //				display.setCursor(0, 16);
        //				display.println("APRS-IS");
        //				display.println("DISCONNECT");
        //				display.display();
        //				client.stop();
        //				//yield();
        //				delay(500);
        //			}
        //			if (millis() > aprsWdt) {
        // #ifdef DEBUG
        //				//SerialLOG.print(client.status());
        //				SerialLOG.println("APRS-IS Timeout!");
        // #endif
        //				client.flush();
        //				client.clearWriteError();
        //				delay(500);
        //				client.stop();
        //				conStat = CON_SERVER;
        //				aprsRetry = 3;
        //				delay(500);
        //			}
        //		}
        //		else {
        // #ifdef DEBUG
        //			SerialLOG.print(client.status());
        //			SerialLOG.println(":WiFi Disconnected");
        // #endif
        //			//WiFi Connected
        //			conStat = CON_WIFI;
        //			client.stopAll();
        //			Udp.stopAll();
        //			WiFi.disconnect(false);
        //			//yield();
        //			delay(500);
        //		}
        //	}
    }
}

// Routine
void line_angle(signed int startx, signed int starty, unsigned int length, unsigned int angle, unsigned int color)
{
    display.drawLine(startx, starty, (startx + length * cosf(angle * 0.017453292519)), (starty + length * sinf(angle * 0.017453292519)), color);
}

int xSpiGlcdSelFontHeight = 8;
int xSpiGlcdSelFontWidth = 5;

void compass_label(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angleNew;
    // ushort Color[2];
    uint8_t x_N, y_N, x_S, y_S;
    int x[4], y[4], i;
    int xOffset, yOffset;
    yOffset = (xSpiGlcdSelFontHeight / 2);
    xOffset = (xSpiGlcdSelFontWidth / 2);
    // GLCD_WindowMax();
    angle += 270.0F;
    angleNew = angle;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x[i] = startx + (length * cosf(angleNew * 0.017453292519));
        y[i] = starty + (length * sinf(angleNew * 0.017453292519));
        x[i] -= xOffset;
        y[i] -= yOffset;
        angleNew += 90.0F;
    }
    angleNew = angle + 45.0F;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x_S = startx + ((length - 3) * cosf(angleNew * 0.017453292519));
        y_S = starty + ((length - 3) * sinf(angleNew * 0.017453292519));
        x_N = startx + ((length + 3) * cosf(angleNew * 0.017453292519));
        y_N = starty + ((length + 3) * sinf(angleNew * 0.017453292519));
        angleNew += 90.0F;
        display.drawLine(x_S, y_S, x_N, y_N, color);
    }
    display.drawCircle(startx, starty, length, color);
    display.setFont();
    display.drawChar((uint8_t)x[0], (uint8_t)y[0], 'N', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[1], (uint8_t)y[1], 'E', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[2], (uint8_t)y[2], 'S', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[3], (uint8_t)y[3], 'W', WHITE, BLACK, 1);
}

void compass_arrow(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angle1, angle2;
    int xdst, ydst, x1sta, y1sta, x2sta, y2sta;
    int length2 = length / 2;
    angle += 270.0F;
    if (angle > 360.0F)
        angle -= 360.0F;
    xdst = startx + length * cosf(angle * 0.017453292519);
    ydst = starty + length * sinf(angle * 0.017453292519);
    angle1 = angle + 135.0F;
    if (angle1 > 360.0F)
        angle1 -= 360.0F;
    angle2 = angle + 225.0F;
    if (angle2 > 360.0F)
        angle2 -= 360.0F;
    x1sta = startx + length2 * cosf(angle1 * 0.017453292519);
    y1sta = starty + length2 * sinf(angle1 * 0.017453292519);
    x2sta = startx + length2 * cosf(angle2 * 0.017453292519);
    y2sta = starty + length2 * sinf(angle2 * 0.017453292519);
    display.drawLine(startx, starty, xdst, ydst, color);
    display.drawLine(xdst, ydst, x1sta, y1sta, color);
    display.drawLine(x1sta, y1sta, startx, starty, color);
    display.drawLine(startx, starty, x2sta, y2sta, color);
    display.drawLine(x2sta, y2sta, xdst, ydst, color);
}

